* DONE Represent a product, with name and price
  CLOSED: [2017-03-06 Mon 08:31]
  :LOGBOOK:
  CLOCK: [2017-03-06 Mon 08:26]--[2017-03-06 Mon 08:31] =>  0:05
  CLOCK: [2017-03-06 Mon 08:26]--[2017-03-06 Mon 08:26] =>  0:00
  :END:
* DONE Create a shopping cart - with product list
  CLOSED: [2017-03-06 Mon 08:56]
  :LOGBOOK:
  CLOCK: [2017-03-06 Mon 08:43]--[2017-03-06 Mon 08:56] =>  0:13
  :END:
* DONE Represent a Bill
  CLOSED: [2017-03-06 Mon 09:11]
* DONE Create bill generator
  CLOSED: [2017-03-06 Mon 10:08]
** BillGenerator accepts a pricelist and list of items
   :LOGBOOK:
   CLOCK: [2017-03-06 Mon 10:01]--[2017-03-06 Mon 10:08] => 0:07
   :END:
* TODO Calculate total price
* TODO Add Offer/Discount Interface
* TODO Implement Offers
* TODO Apply relevant offers one by one to Shopping cart
